Revit 2027 API
FamilyManager.Parameter(Definition) Property
Obtains the parameter of this type with a given definition.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public FamilyParameter this[
	Definition definition
] { get; }
Public ReadOnly Property Parameter (
	definition As Definition
) As FamilyParameter
	Get
public:
property FamilyParameter^ Parameter[Definition^ definition] {
	FamilyParameter^ get (Definition^ definition);
}
member Parameter : FamilyParameter with get
Parameters
definition Definition
Property Value
FamilyParameter
Remarks
Returns null if the parameter is not found.
See Also
Reference
FamilyManager Class
Parameter Overload
Autodesk.Revit.DB Namespace